hazy1k/STM32-Study-Notes/3.开发板必备资料/模块资料/野火【蓝牙_HC05】模块资料/1-配套参考资料和代码/开发板配套例程/F407霸天虎_V1_V2开发板/3.HC05综合测试程序（4.3寸屏）/User/usart/bsp_blt_usart.h
#ifndef __USART3_H
#define	__USART3_H


#include "stm32f4xx.h"
#include <stdio.h>


#define             BLT_USART_BAUD_RATE                       38400

#define             BLT_USARTx                                USART3
#define             BLT_USART_CLK                             RCC_APB1Periph_USART3
#define             BLT_USART_GPIO_CLK                       (RCC_AHB1Periph_GPIOB )     

#define             BLT_USART_TX_PORT                         GPIOB   
#define             BLT_USART_TX_PIN                          GPIO_Pin_10
#define 			BLT_USART_TX_AF              			  GPIO_AF_USART3
#define             BLT_USART_TX_SOURCE                  	  GPIO_PinSource10

#define             BLT_USART_RX_PORT                         GPIOB 
#define             BLT_USART_RX_PIN                          GPIO_Pin_11
#define 		    BLT_USART_RX_AF             			  GPIO_AF_USART3
#define             BLT_USART_RX_SOURCE                  	  GPIO_PinSource11

#define             BLT_USART_IRQ                             USART3_IRQn
#define             BLT_USART_IRQHandler                     USART3_IRQHandler



/* 蓝牙串口数据缓存最大长度 */
#define     UART_BUFF_SIZE      1024


void BLT_USART_Config(void);
void Usart_SendStr_length( USART_TypeDef * pUSARTx, uint8_t *str,uint32_t strlen );
void Usart_SendString( USART_TypeDef * pUSARTx, uint8_t *str);

void bsp_USART_Process(void);
char *get_rebuff(uint16_t *len);
void clean_rebuff(void);

#endif /* __USART3_H */
